## <span style="text-transform:uppercase">production</span> Module: network
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`  


```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```

<details>
  <summary>Show Plan</summary>

  ```terraform
  aws_vpc.main: Refreshing state... [id=vpc-086a4997479cf5b10]
aws_eip.lambda: Refreshing state... [id=eipalloc-0e14bda1148801041]
aws_default_network_acl.default: Refreshing state... [id=acl-0549ea64c0a5dd244]
aws_default_route_table.default: Refreshing state... [id=rtb-0808af644864c76fc]
aws_subnet.public: Refreshing state... [id=subnet-0f56eba7c1dbfdbe1]
aws_default_security_group.default: Refreshing state... [id=sg-05da359a059d41cdd]
aws_internet_gateway.gw: Refreshing state... [id=igw-00e00ca5f9d0d9bb1]
aws_subnet.private: Refreshing state... [id=subnet-06fcfc328ffe9f5d0]
aws_security_group.lambda: Refreshing state... [id=sg-0b77afa7e1b78c3c2]
aws_security_group_rule.inet_egress: Refreshing state... [id=sgrule-2790156866]
aws_route_table.public: Refreshing state... [id=rtb-03b21c36e7aa3f06d]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-0330af1b2a402ec33]
aws_network_acl.main: Refreshing state... [id=acl-03ffeb664fa756d29]
aws_vpc_endpoint.dynamodb: Refreshing state... [id=vpce-00dc3084b7f725d68]
aws_vpc_endpoint.s3: Refreshing state... [id=vpce-06674ae7bb78e969f]
aws_route_table_association.public: Refreshing state... [id=rtbassoc-0e9f78a27f7846671]
aws_route_table.private: Refreshing state... [id=rtb-00da3a96f8b34217a]
aws_route_table_association.a: Refreshing state... [id=rtbassoc-06527543e55cc4b21]
aws_security_group_rule.dynamodb_privatelink: Refreshing state... [id=sgrule-2378049180]
aws_security_group_rule.s3_private_link: Refreshing state... [id=sgrule-1374877533]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.efs will be created
  + resource "aws_security_group" "efs" {
      + arn                    = (known after apply)
      + description            = "Used by EFS"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "metricsstaging_efs_sg"
        }
      + tags_all               = {
          + "Name" = "metricsstaging_efs_sg"
        }
      + vpc_id                 = "vpc-086a4997479cf5b10"
    }

  # aws_security_group_rule.efs_egress will be created
  + resource "aws_security_group_rule" "efs_egress" {
      + description              = "Allow lambda to egress to efs"
      + from_port                = 2049
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0b77afa7e1b78c3c2"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 2049
      + type                     = "egress"
    }

  # aws_security_group_rule.efs_ingress will be created
  + resource "aws_security_group_rule" "efs_ingress" {
      + description              = "Allow communication to EFS from the lambda sg"
      + from_port                = 2049
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0b77afa7e1b78c3c2"
      + to_port                  = 2049
      + type                     = "ingress"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + efs_sg_id = (known after apply)

------------------------------------------------------------------------

This plan was saved to: /home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary"

Releasing state lock. This may take a few moments...
  ```
</details>